# |---------------------------------------------------------------------------------------------------------|
# | 拉格朗日乘数法																								|
# | 描述:																									|
# | 寻找变量受一个或多个条件所限制的多元函数的极值的方法;															|
# | 该方法将有 n 个变量与 k 个约束条件的最优化问题转换为有 n + k 个变量的方程组的极值问题, 且引入了新的标量未知数;			|
# |																											|
# | 步骤:																									|
# | 要找函数 f( x, y ) 在附加条件 Φ( x, y ) = 0 下的可能极值点, 则构造拉格朗日函数:									|
# | L( x, y ) = f( x, y ) + λ * Φ( x, y );																	|
# | 其中: λ 为参数(拉格朗日乘子);																				|
# |																											|
# | 对其求 x 与 y 的偏导数, 并使之为 0, 然后与附加条件联立, 得到方程组:												|
# | df(x, y)⁄dx + λ * dΦ(x, y)⁄dx = 0;																		|
# | df(x, y)⁄dy + λ * dΦ(x, y)⁄dy = 0;																		|
# | Φ( x, y ) = 0;																							|
# |																											|
# | 解方程后得到:																								|
# | x, y, λ, 其中 x, y 就是函数在附加条件 Φ( x, y ) = 0 下的可能极值点;											|
# |																											|
# | 对于其他情况例如四个自变量, 两个条件的情况:																	|
# | 四个自变量: f( x, y, z, t );																				|
# | 两个条件: φ( x, y, z, t ) 和 Φ( x, y, z, t );																|
# | 拉格朗日函数: L( x, y, z, t ) = f( x, y, z, t ) + λ * Φ( x, y, z, t ) + μ * φ( x, y, z, t );				|
# | 其中 λ, μ 均为拉格朗日乘子, 求其各偏导数并使之为 0 且将其与附加条件联立方程组, 可解得可能极值点;						|
# |																											|
# | 例:																										|
# | 设长方体的三棱长分为 x, y, z, 且表面积为 a², 求体积 v = xyz 为最大的值;											|
# |																											|
# | 由表面积条件, 得到附加条件为:																				|
# | a² = 2 * ( x * y + y * z + x * z );																		|
# | φ( x, y, z ) = 2 * ( x * y + y * z + x * z ) - a² = 0;													|
# | 			 = 2xy + 2yz + 2xz - a² = 0;																|
# | 构造拉格朗日函数:																							|
# | L( x, y, z ) = xyz + λ * ( 2xy + 2yz + 2xz - a² );														|
# |																											|
# | 微分求极值:																								|
# | 1: dL(x, y, z)⁄dx = yz + 2λ( y + z ) = 0;																|
# | 2: dL(x, y, z)⁄dy = xz + 2λ( x + z ) = 0;																|
# | 3: dL(x, y, z)⁄dz = xy + 2λ( y + x ) = 0;																|
# | 4: 2xy + 2yz + 2xz - a² = 0;																			|
# |																											|
# | 由 (1), (2), (3) 得到 x = y = z = 4λ 代入 (4) 得到:														|
# | x = y = z = ( √(6) * a ) / 6;																			|
# |---------------------------------------------------------------------------------------------------------|
