# |---------------------------------------------------------------------------------------------------------|
# | 步骤:																									|
# | 1: 数据去均值, 使每个维度特征均值为 0;																		|
# | 	1): 去均值以便计算方差, 协方差矩阵等;																		|
# | 2: 寻找第一个单位向量做为第一主成分使数据在该方向上的投影方差最大;													|
# | 	1): 投影方差越大说明数据越分散, 越分散说明越能从原数据中保存更多的信息, 可最大程度避免重叠;						|
# | 	2): 使用单位向量可使得更方便计算投影值;																	|
# | 3: 寻找第二个单位向量做为第二主成分, 确保与第一主成分向量垂直, 且方差仅次于第一主成分;								|
# | 	1): 正交的基相关性为 0, 能后最大程度保留信息;																|
# | 4: 循环 2 - 3;																							|
# | 5: 最终将保留方差最大的靠前的主成分中, 而靠后的方差几乎为 0 的主成分可忽略, 因为它对保存数据影响不大;					|
# | 6: 将所有得到的主成分基向量构成矩阵, 原始数据集乘以该矩阵实现 PCA;												|
# |---------------------------------------------------------------------------------------------------------|

# |---------------------------------------------------------------------------------------------------------|
# | 推导:																									|
# | 假设存在已去均值的 m 个样本 n 个特征的数据集矩阵 Aₘₙ:															|
# | 	--                     --																			|
# | 	|  A₁₁ A₁₂ A₁₃ ... A₁ₙ	|																			|
# | 	|  A₂₁ A₂₂ A₂₃ ... A₂ₙ	|																			|
# | A = |  A₃₁ A₃₂ A₃₃ ... A₃ₙ	|;																			|
# | 	|  ...               	|																			|
# | 	|  Aₘ₁ Aₘ₂ Aₘ₃ ... Aₘₙ	|																			|
# | 	--                     --																			|
# |																											|
# | 第一个主成分向量为 w, 则第 i 个样本 xᵢ 到 w 上的投影值(标量)为:													|
# | pᵢ = xᵢᵀ * w;																							|
# |																											|
# | 共存在 m 个投影值, 计算所有投影值的样本方差( 已去均值的样本方差: S² = ∑ⁿᵢ₌₁( xᵢ² ) / ( n - 1 ) ):					|
# | S² = ( 1 / ( m - 1 ) ) * ∑ᵐᵢ₌₁( pᵢ² );																	|
# |    = ( 1 / ( m - 1 ) ) * ∑ᵐᵢ₌₁( ( xᵢᵀ * w )² );															|
# |    = ( 1 / ( m - 1 ) ) * ( ( A * w )ᵀ * ( A * w ) );													|
# |    = ( 1 / ( m - 1 ) ) * ( wᵀ * Aᵀ * A * w );															|
# |    = wᵀ * ( ( 1 / ( m - 1 ) ) * ( Aᵀ * A ) ) * w;														|
# |    = wᵀ * Cov * w; ( 已去均值的协方差矩阵可表示为: Cov = ( 1 / ( m - 1 ) ) * Aᵀ * A );						|
# |																											|
# | 对 S² = wᵀ * Cov * w 构造拉格朗日函数以求得方差最大值:														|
# | L( w ) = wᵀ * Cov * w + λ * ( 1 - wᵀ * w );																|
# | 	   = w² * Cov + λ * ( 1 - w² );																		|
# | 	   = w² * Cov - w² * λ + λ;																			|
# |																											|
# | 对其微分求极值:																							|
# | dL( w )⁄dw = 2 * Cov * w + λ * ( 1 - 2 * w ) = 0;														|
# | 		   = 2 * Cov * w - 2 * λ * w = 0;																|
# |																											|
# | 得到:																									|
# | 2 * w * Cov = 2 * λ * w;																				|
# | Cov * w = λ * w;																						|
# |																											|
# | 由此可知, w 为协方差矩阵 Cov 的特征向量, 将 Cov * w = λ * w 代入 S² = wᵀ * Cov * w 得到方差就是 λ:				|
# | S² = wᵀ * λ * w;																						|
# |    = wᵀ * w * λ;																						|
# |    = λ;																									|
# |																											|
# | 求得矩阵 Cov 的最大的那个特征值对应的特征向量就是第一主成分:														|
# |																											|
# | 继续求得第二个主成分向量, 第二个主成分向量满足条件:																|
# | 1: vᵀw = 0;																								|
# | 2: vᵀv = 1;																								|
# | 3: v 的投影方差仅次于 w;																					|
# |																											|
# | 若将每个样本 xᵢ 分解为与 w 平行和正交的两个向量, 分别为:														|
# | 1: 平行: wᵀxᵢw;																							|
# | wᵀxᵢ 代表投影长度;																							|
# | wᵀxᵢw 代表投影向量;																						|
# |																											|
# | 2: 正交: xᵢ - wᵀxᵢw;																						|
# | xᵢ 减去反方向的平行向量得到正交向量;																			|
# |																											|
# | 分解的目的在于将每个样本 xᵢ 在第一主成分上能充分表达的部分舍去, 剩下的部分用第二主成分充分表达, 即:						|
# | 使用 xᵢ - xᵢwᵀw 来代替 xᵢ 继续寻找特征值最大的特征向量, 做为第二主成分;											|
# |																											|
# | 目前剔除 w 分量后的新数据集为:																				|
# | B = A - Awᵀw;																							|
# |																											|
# | 充分寻找第一主成分向量的步骤, 依次得到第二, 第三, ... 主成分向量;													|
# |																											|
# | 注意: 协方差矩阵 Cov 是对称矩阵, 所以其特征向量都是正交关系, 故也可直接在计算到所有特征值后依次按大小取特征向量:			|
# |																											|
# | 最后数据集乘以由主成分基向量构成的矩阵即可达到降维的目的;															|
# |---------------------------------------------------------------------------------------------------------|



