2021-08-02 19:30
分析周期: 日线级别;

裸 K:
2021-07-20 阴线 -> 2021-07-21 阳线 -> 形成看涨吞没
从 2021-07-22 开始连涨 9 天到 2021-07-30
从 2021-07-30 开始下跌, 理解为多头能量耗尽, 如何观测?
* 没有任何的形态可供分析;

MA:
MA30, MA60, MA120
k 线在 MA120 附近回落, 说明 MA120 起到了压制作用;
若 k 线突破 MA120 将迎来一波大幅度上涨;
预测: 若突破将迎来继续上涨, 未突破将继续下行;
* 从 8 月 6 日突破 MA120 后一直到 9 月 6 日综合上涨了一个月;
* 因月交易天数为 30 天, 故设置 MA30, 另外 MA60 和 MA120 分别是 30 * 2 与 60 * 2 得来;

EMA:
vegas 第一通道 EMA144 EMA169
vegas 第二通道 EMA288 EMA338
k 线正好踩在 vegas 第一通道上, 即将跌破;
预测: 跌破后将前往 vegas 第二通道
* 实际上没有跌到 vegas 第二通道

Boll:
预测: 跌倒 Boll 带中轨
* 实际上没有跌到中轨, 但接近中轨