# |---------------------------------------------------------------------------------|
# | 当预测函数为: y` = w * x; 时的损失函数形态											|
# |																					|
# | e` = ¹⁄ₙ * ∑ⁿᵢ₌₁( eⁱ );															|
# | 1): n: 数据长度																	|
# | 2): i: 数据索引																	|
# | 3): eⁱ: 每项预测值与实际值的误差														|
# | *): 误差止和除以数据长度计算得到均方差												|
# |																					|
# | e` = ¹⁄ₙ * ∑ⁿᵢ₌₁( y`ⁱ - yⁱ )²;													|
# | 1): y`ⁱ: 预测值																	|
# | 2): yⁱ: 真实值																	|
# | *): 平方误差可消除负值并且对误差起到放大作用并使函数全程可导;								|
# |																					|
# | e` = ¹⁄ₙ * ∑ⁿᵢ₌₁( w * xⁱ - yⁱ )²;												|
# | *): 将 y`ⁱ = w * xⁱ 带入;															|
# |																					|
# | e` = ¹⁄ₙ * ∑ⁿᵢ₌₁( w² * xⁱ² - 2 * w * xⁱ * yⁱ - yⁱ² );							|
# | *): 完全平方公式展开: ( a - b )² = a² - 2 * a * b + b²;							|
# |																					|
# | e` = ¹⁄ₙ * ∑ⁿᵢ₌₁( xⁱ² * w² ) - ²⁄ₙ * ∑ⁿᵢ₌₁( w * xⁱ * yⁱ ) + ¹⁄ₙ * ∑ⁿᵢ₌₁( yⁱ² );	|
# | *): 求和公式展开 1: ∑ⁿᵢ₌₁( a * xⁱ ) = a * ∑ⁿᵢ₌₁( xⁱ );								|
# | *): 求和公式展开 2: ∑ⁿᵢ₌₁( a + b ) = ∑ⁿᵢ₌₁( a ) + ∑ⁿᵢ₌₁( b );						|
# |																					|
# | e` = a * w² + b * w + c;														|
# | 1): 常数 a = ¹⁄ₙ * ∑ⁿᵢ₌₁( xⁱ² );													|
# | 2): 常数 b = ²⁄ₙ * ∑ⁿᵢ₌₁( xⁱ * yⁱ );												|
# | 3): 常数 c = ¹⁄ₙ * ∑ⁿᵢ₌₁( yⁱ² );													|
# | *): 将方程常数重新命名得到损失函数													|
# |																					|
# | 推导损失函数为: e` = a * w² + b * w + c;											|
# |																					|
# |	使用梯度下降算法计算 a, b 为何值时损失函数最小											|
# |																					|
# | 不同的预测函数通过最小二乘法可以得到不用的拟合曲线, 不同的拟合曲线对应的不同的损失函数			|
# |---------------------------------------------------------------------------------|

# |---------------------------------------------------------------------------------|
# |	当预测函数为 f( x ) = w * x + b; 是对损失函数求偏导									|
# |																					|
# | 预测函数: f( x ) = w * x + b														|
# | 损失函数: e( w, b ) = e` = ¹⁄₂ₙ * ∑ⁿᵢ₌₁( ( w * xⁱ + b - yⁱ )² );					|
# |																					|
# | 微分																				|
# | ∂e(w, b)⁄∂ = ¹⁄₂ₙ * ∑ⁿᵢ₌₁( ( ( f( xⁱ ) - yⁱ )² )` );								|
# | *): 导函数加法运算法制: ( f + g )` = f` + g`;										|
# |																					|
# | ∂e(w, b)⁄∂ = ¹⁄₂ₙ * ∑ⁿᵢ₌₁( ( ( f( xⁱ ) - yⁱ )² )` );								|
# | 		   = ¹⁄₂ₙ * ∑ⁿᵢ₌₁( 2 * ( ( f( xⁱ ) - yⁱ ) * ( f( xⁱ ) - yⁱ ) )` );		|
# | 		   = ¹⁄ₙ * ∑ⁿᵢ₌₁( ( f( xⁱ ) - yⁱ ) * ( f( xⁱ ) - yⁱ )` );				|
# | 		   = ¹⁄ₙ * ∑ⁿᵢ₌₁( ( w * xⁱ + b - yⁱ ) * ( w * xⁱ + b - yⁱ )` );			|
# | *): 复合函数求偏导: f`( g( x ) ) = f`( t ) * g`( x ); 其中: t = g( x );				|
# |																					|
# | 计算各项偏导数																		|
# | ∂e(w, b)/∂b = ¹⁄ₙ * ∑ⁿᵢ₌₁( ( f( xⁱ ) - yⁱ ) );									|
# | *): 对 ∂⁄∂b( w * xⁱ + b - yⁱ ) = 1; 代入后计算损失函数得到关于 b 的偏导数				|
# |																					|
# | ∂e(w, b)/∂w = ¹⁄ₙ * ∑ⁿᵢ₌₁( ( f( xⁱ ) - yⁱ ) * w );								|
# | *): 将 ∂⁄∂w( w * xⁱ + b - yⁱ ) = xⁱ; 代入后计算损失函数得到关于 w 的偏导数				|
# |---------------------------------------------------------------------------------|



