# |---------------------------------------------------------------------------------|
# | 损失函数:																			|
# | 1:																				|
# | if p( x ) >= 0.5: y` = 1;														|
# | if p( x ) < 0.5:  y` = 0;														|
# | # 若 p( x ) 小于 0.5 则认为 y` 为 0, 若 p( x ) 大于 0.5 则认为 y` 为 1;				|
# | # p( x ): sigmoid 函数得到的实际预测值												|
# | # y`: 预测结论值																	|
# |																					|
# | 2:																				|
# | if y == 1: p( x ) 越大 cost 越小, p( x ) 越小 cost 越大							|
# | if y == 0: p( x ) 越大 cost 越大, p( x ) 越小 cost 越小							|
# | # 若 p( x ) = 0.5 得到 y 为 1, 则 cost 最大										|
# | # 若 p( x ) = 1 得到 y 为 1, 则 cost 最小											|
# | #																				|
# | # 若 p( x ) = 0.499... 得到 y 为 0, 则 cost 最大									|
# | # 若 p( x ) = 0 得到 y 为 0, 则 cost 最小											|
# |																					|
# | 3:																				|
# | if y == 1: cost = -log( p( x ) );												|
# | if y == 0: cost = -log( 1 - p( x ) );											|
# | # 若 y 为 1 的损失函数图像															|
# | # log 函数 x 轴反转后取 0 < x < 1 部分的函数图像										|
# | # 过 ( 1, 0 ) 点的减函数, p( x ) = 0, cost = +∞; p( x ) = 1, cost = 0;				|
# | #																				|
# | # 若 y 为 0 的损失函数图像															|
# | # log 函数 x, y 轴反转向 x 轴正方向平移 1 后取 0 < x < 1 部分的函数图像					|
# | # 过 ( 0, 0 ) 点的增函数, p( x ) = 0, cost = 0; p( x ) = 1, cost = +∞;				|
# |																					|
# | 4:																				|
# | cost = -y * log( p( x ) ) - ( 1 - y ) * log( 1 - p( x ) );						|
# | # y 为 0 和 1 的情况合并后的单样本损失函数											|
# |																					|
# | 5:																				|
# | e = ¹⁄ₙ * ∑ⁿᵢ₌₁( -yⁱ * log( p( xⁱ ) ) - ( 1 - yⁱ ) * log( 1 - p( xⁱ ) ) );		|
# |   = ¹⁄ₙ * ∑ⁿᵢ₌₁( -( yⁱ * log( p( xⁱ ) ) + ( 1 - yⁱ ) * log( 1 - p( xⁱ ) ) ) );	|
# |   = ⁻¹⁄ₙ * ∑ⁿᵢ₌₁( yⁱ * log( p( xⁱ ) ) + ( 1 - yⁱ ) * log( 1 - p( xⁱ ) ) );		|
# | # n: 样本总数																		|
# | # i: 样本项																		|
# | # n 个样本的损失函数																|
# |---------------------------------------------------------------------------------|

# |---------------------------------------------------------------------------------|
# | 损失函数求导:																		|
# | j(θ) = ⁻¹⁄ₙ * ∑ⁿᵢ₌₁( yⁱ * log( p( xⁱ ) ) + ( 1 - yⁱ ) * log( 1 - p( xⁱ ) ) );	|
# |																					|
# | logistic:																		|
# | p(x) = 1 ⁄ ( 1 + e⁻ᶿᵀˣ );														|
# |																					|
# | 对数求导规则:																		|
# | 1: In( x )` = 1 ⁄ x;																|
# | 2: f`( g(x) ) = f`( t ) * g`( x ); 其中: t = g(x);								|
# | 3: In( f(x) )` = ( 1 ⁄ f(x) ) * f`( x );											|
# | 4: (e⁻ᶿˣ)` = e⁻ᶿˣ * (θ * x)` = e⁻ᶿˣ * -x;										|
# |																					|
# | 求导过程:																			|
# | 1: ∂⁄∂θⱼ( In( p(x) ) ) = ∂⁄∂θⱼ( In( 1 ⁄ ( 1 + e⁻ᶿᵀˣ ) ) )						|
# | 					   = ∂⁄∂θⱼ( In( 1 ) - In( 1 + e⁻ᶿᵀˣ ) )						|
# | 					   = ∂⁄∂θⱼ( -In( 1 + e⁻ᶿᵀˣ ) )								|
# | 					   = -( 1 ⁄ ( 1 + e⁻ᶿᵀˣ ) ) * ∂⁄∂θⱼ( 1 + e⁻ᶿᵀˣ )				|
# | 					   = -( 1 ⁄ ( 1 + e⁻ᶿᵀˣ ) ) * ∂⁄∂θⱼ( e⁻ᶿᵀˣ )					|
# | 					   = -( 1 ⁄ ( 1 + e⁻ᶿᵀˣ ) ) * e⁻ᶿᵀˣ * -x						|
# | 					   = ( 1 - ( 1 ⁄ ( 1 + e⁻ᶿᵀˣ ) ) ) * x						|
# |																					|
# | 2: ∂⁄∂θⱼ( In( 1 - p(x) ) ) = ∂⁄∂θⱼ( In( 1 - 1 ⁄ ( 1 + e⁻ᶿᵀˣ ) ) )				|
# | 						   = ∂⁄∂θⱼ( In( e⁻ᶿᵀˣ ⁄ ( 1 + e⁻ᶿᵀˣ ) ) )				|
# | 						   = ∂⁄∂θⱼ( In( e⁻ᶿᵀˣ ) ) - ∂⁄∂θⱼ( In( 1 + e⁻ᶿᵀˣ ) )		|
# | 						   = ∂⁄∂θⱼ( -θᵀ * x ) - ∂⁄∂θⱼ( In( 1 + e⁻ᶿᵀˣ ) )			|
# | 						   = -x + ( 1 - ( 1 ⁄ ( 1 + e⁻ᶿᵀˣ ) ) ) * x				|
# | 						   = -( 1 ⁄ ( 1 + e⁻ᶿᵀˣ ) ) * x							|
# |																					|
# | 将 1, 2, p(x) 带入函数 j(θ) 求得关于 θⱼ 的导数:										|
# | ∂j(θ)⁄∂θ = ⁻¹⁄ₙ * ∑ⁿᵢ₌₁(															|
# | 	( yⁱ * x * ( 1 - ( 1 ⁄ ( 1 + e⁻ᶿᵀˣ ) ) ) ) -									|
# | 	( ( 1 - yⁱ ) * x * ( 1 ⁄ ( 1 + e⁻ᶿᵀˣ ) ) )									|
# | );																				|
# |																					|
# | ∂j(θ)⁄∂θ  = ⁻¹⁄ₙ * ∑ⁿᵢ₌₁(														|
# | 	( yⁱ * x * ( 1 - p(x) ) ) - ( ( 1 - yⁱ ) * x * p(x) )						|
# | );																				|
# |																					|
# | ∂j(θ)⁄∂θ  = ⁻¹⁄ₙ * ∑ⁿᵢ₌₁(														|
# | 	x * ( ( yⁱ * ( 1 - p(x) ) ) - ( ( 1 - yⁱ ) * p(x) ) )						|
# | );																				|
# |																					|
# | ∂j(θ)⁄∂θ  = ⁻¹⁄ₙ * ∑ⁿᵢ₌₁(														|
# | 	x * ( yⁱ - yⁱ * p(x) - p(x) + yⁱ * p(x) )									|
# | );																				|
# |																					|
# | ∂j(θ)⁄∂θ  = ¹⁄ₙ * ∑ⁿᵢ₌₁(	 x * ( p(x) - yⁱ ) );									|
# |																					|
# | 得到函数 j(θ) 求得关于 θⱼ 的导数:													|
# | ∂j(θ)⁄∂θ  = ¹⁄ₙ * ∑ⁿᵢ₌₁( x * ( p(x) - yⁱ ) );									|
# |																					|
# | 得到函数 j(θ) 求得关于 θ₀ 的导数:													|
# | ∂j(θ)⁄∂θ₀ = ¹⁄ₙ * ∑ⁿᵢ₌₁( p(x) - yⁱ );											|
# |---------------------------------------------------------------------------------|
