# |---------------------------------------------------------------------------------|
# | 定义:																			|
# | 若 aˣ = b; 则 x = logₐ(b); -> 意义是求 b 等于 a 的多少次方							|
# | 																				|
# | 对数运算规则:																		|
# | 1: logₐ(M) + logₐ(N) = logₐ(M * N);												|
# | 2: logₐ(M) - logₐ(N) = logₐ(M / N);												|
# | 3: logₐ(M)ᴷ = k * logₐ(M);														|
# | 4: logₐᴷ(M) = logₐ(M) / k;														|
# | 5: logₘ(n) = logₚ(a) / logₚ(b)													|
# | 6: logₘ(n) = logₘ(a) * logₐ(n)													|
# |---------------------------------------------------------------------------------|
