# |-----------------------------------------------------------------------------------------------------------------------------------------|
# | 似然																																		|
# |																																			|
# | 概率: 利用已知的概率模型对随机事件发生的可能性大小的定量描述;																						|
# | 似然: 首先观察随机事件的结果再去推测概率模型;																									|
# |																																			|
# | 例: 抛硬币 100 次, 70 次正面朝上, 30 次反面朝上;																								|
# | 由于 70% 和 30% 是唯一的数据支撑, 因此猜测正面朝上的概率为 70%, 反面朝上的概率为 30%, 该过程就是似然;												|
# |																																			|
# | 似然函数: 该结果产生的概率的函数;																												|
# | l( p: 概率 ) = p⁷⁰ * ( 1 - p )³⁰;																										|
# |																																			|
# | 最大似然估计:																																|
# | 要推测 p 最好的估计应是使得似然函数值最大的某 p 值;																								|
# |																																			|
# | 求导: 当导函数取到 0 时就对应着似然函数的最大值,																								|
# | 因为 p 和 1 - p 都是小于 1 并且函数次数太高导致计算机计算的函数值过小引起数值下溢问题, 所以对似然函数取对数将连乘变成连加, 解决了计算问题也不会改变导函数的解	|
# | In( l( p ) ) = 70 * In( p ) + 30 * In( 1 - p );																							|
# | ( In( l( p ) ) )` = ( 70 * In( p ) + 30 * In( 1 - p ) )`;																				|
# |                   = ( 70 * In( p ) )` + ( 30 * In( 1 - p ) )`;																			|
# |                   = 70 / p + 30 / ( 1 - p ) * ( 1 - p )`;																				|
# |                   = 70 / p + 30 / ( 1 - p ) * -1;																						|
# |                   = 70 / p - 30 / ( 1 - p );																							|
# |																																			|
# | 代入函数值为 0: ( In( l( p ) ) )` = 0; 得到: p = 0.7;																						|
# | 所以概率 0.7 就是基于数据构建出似然函数的最优解;																								|
# |-----------------------------------------------------------------------------------------------------------------------------------------|

# |-----------------------------------------------------------------------------------------------------------------------------------------|
# | 概率密度: 描述某事发生在某区间的概率大小;																										|
# |																																			|
# | 定义:																																	|
# | 1: 将区间长度变得无限小形成的曲线或面																											|
# |     1): 概率密度: 一维的情况连续性的情况;																										|
# |     2): 联合概率密度: 多维的情况连续性的情况;																									|
# |																																			|
# | 2: 概率密度函数或联合概率密度的积分叫																											|
# |     1): 分布函数: ∫(-∞, x)( f( x ) ) * dx;																								|
# |     2): 联合分布函数: ∫(-∞, x)∫(-∞, y)( f( x, y ) ) * dx * dy;																				|
# |																																			|
# | 性质:																																	|
# | 1: 概率密度 = f( x ) = 概率 / 区间长度 = 概率 / dx;																							|
# |     1): f( x ) >= 0;																													|
# |     2): f( x ) 不是概率, 是概率除以区间长度;																									|
# |																																			|
# | 2: 某 x 的概率 = f( x ) * dx = ( 概率 / dx ) * dx = 概率;																					|
# |																																			|
# | 3: 概率只和 = ∫( -∞, +∞ )( f( x ) ) * dx = 1;																								|
# |																																			|
# | 4: 分布函数 = F( x ) = ∫( x, +∞ )( f( x ) ) * dx;																							|
# |-----------------------------------------------------------------------------------------------------------------------------------------|

# |-----------------------------------------------------------------------------------------------------------------------------------------|
# | 观察某一个过程中得到一系列数据:																												|
# | x₁, x₂, x₃, ..., xₙ;																														|
# |																																			|
# | 该过程对应的真实值:																															|
# | x;																																		|
# |																																			|
# | 一般来说对某过程的多次测量的算数平均值作为真实值:																								|
# | x = x⁻ = ( x₁ + x₂ + x₃ + ... + xₙ ) / n;																								|
# |																																			|
# | 每次观察值与背后真实值之间的差距:																												|
# | e₁ = x₁ - x, e₂ = x₂ - x, e₃ = x₃ - x, ..., eₙ = xₙ - x;																					|
# |																																			|
# | 函数 f 反应 eᵢ 与 x 之间的关系误差概率函数:																									|
# | f( e );																																	|
# |																																			|
# | 似然函数:																																	|
# | l( x ) = f( e₁ ) * f( e₂ ) * f( e₃ ) * ... * f( eₙ );																					|
# | 	   = f( x₁ - x ) * f( x₂ - x ) * f( x₃ - x ) * f( xₙ - x );																			|
# |																																			|
# | 对似然函数取对数:																															|
# | In( l( x ) ) = ∑ⁿᵢ₌₁( In( f( xᵢ - x ) ) );																								|
# |																																			|
# | 对其求导数:																																|
# | In( l( x ) )` = ( ∑ⁿᵢ₌₁( In( f( xᵢ - x ) ) ) )`;																						|
# | 			  = ∑ⁿᵢ₌₁( ( 1 / f( xᵢ - x ) ) * f`( xᵢ - x ) );																			|
# | 			  = ∑ⁿᵢ₌₁( f`( xᵢ - x ) / f( xᵢ - x ) );																					|
# |																																			|
# | 令导函数为 0 求得最大似然估计:																												|
# | In( l( x ) )` = ∑ⁿᵢ₌₁( f`( xᵢ - x ) / f( xᵢ - x ) ) = 0;																				|
# |																																			|
# | 令:																																		|
# | g( x ) = f`( x ) / f( x );																												|
# |																																			|
# | 得到:																																	|
# | In( l( x ) )` = ∑ⁿᵢ₌₁( g( xᵢ - x ) ) = 0;																								|
# |																																			|
# | 假设真实值:																																|
# | x = ( x₁ + x₂ + x₃ + ... + xₙ ) / n;																										|
# | 此假设的目的在于: 将原来用于估计真实值 x 而转换来的似然函数的导数变成 n 元方程用于对 n 次观测得到的观察值 xᵢ 的估计;										|
# | 基于这种假设, x₁, x₂, x₃, ..., xₙ 变量就不再是已知的观察值, 而是 n 次观测得到的 n 个未知的观察值 xᵢ, 而 x 则是已知值;									|
# | 最大似然估计推测 xᵢ 仍满足 xᵢ 的偏导数都为 0;																									|
# |																																			|
# | 求偏导数:																																	|
# | x₁ 的偏导数:																																|
# | g`( x₁ - x ) * ( 1 - 1 / n ) + g`( x₂ - x ) * ( - 1 / n ) + g`( x₃ - x ) * ( - 1 / n ) + ... + g`( xₙ - x ) * ( - 1 / n ) = 0;			|
# | 其中 1 - 1 / n 的由来: ( x₁ - x )` = ( x₁ - ( x₁ + x₂ + x₃ + ... + xₙ ) / n )`;															|
# | 								 = ( x₁ - x₁ / n )`;																					|
# | 								 = 1 - 1 / n;																							|
# |																																			|
# | 其中 - 1 / n 的由来: ( x₂ - x )` = ( x₂ - ( x₁ + x₂ + x₃ + ... + xₙ ) / n )`;																|
# | 							   = 0 - 1 / n;																								|
# | 							   = - 1 / n;																								|
# | ... ...																																	|
# | x₂ 的偏导数:																																|
# | g`( x₁ - x ) * ( -1 / n ) + g`( x₂ - x ) * ( 1 - 1 / n ) + g`( x₃ - x ) * ( -1 / n ) + ... + g`( xₙ - x ) * ( -1 / n ) = 0;				|
# | x₃ 的偏导数:																																|
# | g`( x₁ - x ) * ( -1 / n ) + g`( x₂ - x ) * ( -1 / n ) + g`( x₃ - x ) * ( 1 - 1 / n ) + ... + g`( xₙ - x ) * ( -1 / n ) = 0;				|
# | ... ...																																	|
# | xₙ 的偏导数:																																|
# | g`( x₁ - x ) * ( -1 / n ) + g`( x₂ - x ) * ( -1 / n ) + g`( x₃ - x ) * ( -1 / n ) + ... + g`( xₙ - x ) * ( 1 - 1 / n ) = 0;				|
# |																																			|
# | 转化为矩阵形式:																															|
# | --                                                  --   --            --   -- --														|
# | | 1 - 1 / n     -1 / n      -1 / n   ...      -1 / n |   | g`( x₁ - x ) |   | 0 |														|
# | |    -1 / n  1 - 1 / n      -1 / n   ...      -1 / n | * | g`( x₂ - x ) | = | 0 |														|
# | |    -1 / n     -1 / n   1 - 1 / n   ...      -1 / n |   | g`( x₃ - x ) |   | 0 |														|
# | |    ...                                             |   | ...          |   | 0 |														|
# | |    -1 / n     -1 / n      -1 / n   ...   1 - 1 / n |   | g`( xₙ - x )	|   | 0 |														|
# | --                                                  --   --            --   -- --														|
# |																																			|
# | 对矩阵化简:																																|
# | 	--                                                              --        --                    --									|
# | 	| 1 - 1 / n     -1 / n      -1 / n   ...      -1 / n      -1 / n |        | 1   0   0 ... 0   -1 |									|
# | 	|    -1 / n  1 - 1 / n      -1 / n   ...      -1 / n      -1 / n |        | 0   1   0 ... 0   -1 |									|
# | A = |    -1 / n     -1 / n   1 - 1 / n   ...      -1 / n      -1 / n | -> R = | 0   0   1 ... 0   -1 |;									|
# | 	|    ...                                                         |        | ...                  |									|
# | 	|    -1 / n     -1 / n      -1 / n   ...   1 - 1 / n      -1 / n |        | 0   0   0 ... 1   -1 |									|
# | 	|    -1 / n     -1 / n      -1 / n   ...      -1 / n   1 - 1 / n |        | 0   0   0 ... 0    0 |									|
# | 	--                                                              --        --                    --									|
# |																																			|
# | 得到 g( x ) 的函数图像:																													|
# | 该矩阵 A 为 n * n 方阵, 秩为 n - 1, 只存在一个自由列;																							|
# | x₁ = xₙ, x₂ = xₙ, x₃ = xₙ, ..., xₙ₋₁ = xₙ, xₙ = 自由变量;																					|
# | g`( x₁ - x ) = g`( x₂ - x ) = g`( x₃ - x ) = ... = g`( xₙ - x ) = 常数 c;																	|
# | g( x ) 的导函数 g`( x ) 是一个常数, 则 g( x ) 为一条直线: g( x ) = cx + b;																	|
# |																																			|
# | 将 g( x ) = cx + b 代入 ∑ⁿᵢ₌₁( g( xᵢ - x ) ) 得到:																						|
# | ∑ⁿᵢ₌₁( c * ( xᵢ - x ) + b ) = c * ∑ⁿᵢ₌₁( xᵢ - x ) + n * b;																				|
# | 							= c * ∑ⁿᵢ₌₁( xᵢ ) - c * ∑ⁿᵢ₌₁( x ) + n * b;																	|
# | 							= c * n * x - c * n * x + n * b;																			|
# | 							= n * b;																									|
# |																																			|
# | 将似然函数赋值为 0( 最大似然估计 ) ∑ⁿᵢ₌₁( g( xᵢ - x ) ) = 0 得到 b:																			|
# | ∑ⁿᵢ₌₁( c * ( xᵢ - x ) + b ) = n * b = 0;																								|
# | 								  b = 0;																								|
# |																																			|
# | 将 b = 0 代入 g( x ) = cx + b 和 g( x ) = f`( x ) / f( x ) 得到 f( x ) 的微分方程:															|
# | g( x ) = f`( x ) / f( x ) = cx;																											|
# |																																			|
# | 解 f( x ) 微分方程:																														|
# | 因为: ( In( x ) )` = 1 / x;																												|
# | 则: ( In( f( x ) ) )` = f`( x ) / f( x ) = g( x ) = cx;																					|
# | In( f( x ) ) = c * x² / 2 + b;																											|
# | f( x ) = eʰ⁽ˣ⁾; h( x ) = cx² / 2 + b;																									|
# | f( x ) = k * eʰ⁽ˣ⁾; h( x ) = cx² / 2; k = eᵇ;																							|
# |																																			|
# | 又由于 f( x ) 概率函数须满足 ∫( -∞, +∞ ) f( x ) dx = 1( 概率总和为 100% ):																	|
# | 故函数必须收敛, 则 c 须小于 0( c < 0 ), 人为设定 c = -1 / σ², σ 为方差;																		|
# |																																			|
# | 将 c = -1 / σ² 代入 ∫( -∞, +∞ ) f( x ) dx = 1, 计算 k:																					|
# | 代入得到: ∫( -∞, +∞ ) k * eʰ⁽ˣ⁾ dx = 1; h( x ) = -x² / 2σ²;																				|
# | 因为观察函数 f( x ) 发现函数图像对称, 故: 2 * k * ∫( 0, +∞ ) eʰ⁽ˣ⁾ dx = 1;																	|
# | 令 t = x² / 2σ², 则 x = σ * √( 2t );																										|
# | 将 x = σ * √( 2t ) 代入 2k∫( 0, +∞ ) eʰ⁽ˣ⁾ dx = 1, 得到: 2 * k * ∫( 0, +∞ )e⁻ᵗ d σ * √( 2t ) = 1;											|
# | 求微分: 2 * k * ∫( 0, +∞ )e⁻ᵗ d √( 2 ) * σ * t⁰˙⁵ = 1;																					|
# | 	   2 * k * ∫( 0, +∞ )e⁻ᵗ √( 2 ) * σ * 0.5 * t⁻⁰˙⁵ dt = 1;																			|
# | 	   √( 2 ) * σ * k * ∫( 0, +∞ )e⁻ᵗ * t⁻⁰˙⁵ dt = 1;																					|
# | 得到: Γ( 0.5 ) = 1;																														|
# | 代入得到 k:																																|
# | k = 1 / ( √( 2 ) * σ * Γ( 0.5 ) );																										|
# | k = 1 / ( √( 2 ) * σ * √( ℼ ) );																										|
# | k = 1 / ( σ * √( 2ℼ ) );																												|
# |																																			|
# | 将 k = 1 / ( σ * √( 2ℼ ) ) 代回得到高斯分布:																								|
# | f( x ) = k * eʰ⁽ˣ⁾; h( x ) = -x² / 2σ²; k = 1 / ( σ * √( 2ℼ ) );																		|
# |																																			|
# | 在图像上函数对称, 通过移动均值 μ 时得到函数图像, 即 x = μ 为图像的对称轴:																			|
# | f( x ) = k * eʰ⁽ˣ⁾; h( x ) = -( x - μ )² / 2σ²; k = 1 / ( σ * √( 2ℼ ) );																|
# |-----------------------------------------------------------------------------------------------------------------------------------------|

# |-----------------------------------------------------------------------------------------------------------------------------------------|
# | 3σ 原则																																	|
# | 数值分布在( μ — σ, μ + σ ) 中的概率为 0.6526;																								|
# | 数值分布在( μ — 2σ, μ + 2σ ) 中的概率为0.9544;																								|
# | 数值分布在( μ — 3σ, μ + 3σ ) 中的概率为0.9974;																								|
# | 若数据服从正态分布, 在 3σ 原则下, 正负 3 σ 的概率是99.7%, 距离平均值 3∂ 之外的值出现的概率为P ( | x - u | > 3σ ) <= 0.003, 属于极个别的小概率事件,		|
# | 异常值如超过 3 倍标准差 σ, 则可将其视为异常值;																									|
# |-----------------------------------------------------------------------------------------------------------------------------------------|

