# |---------------------------------------------------------------------------------|
# | 不定积分: y = f( x ) = ∫dy = ∫( dy / dx ) * dx;									|
# |																					|
# | 例1:																				|
# | y = ∫dy = ∫( 2x + 1 ) * dx = x² + x + c;										|
# |																					|
# | c:																				|
# | 不定常数;																			|
# |																					|
# | ∫( 2x + 1 ) * dx:																|
# | 代表求出某式子微分后等得到 2x + 1, 而得到的某式子就是 y 函数;							|
# | 存在 c 这种多种可能的存在, 所以 ∫( 2x + 1 ) * dx 也称为不定积分;						|
# |																					|
# | 反导函数:																			|
# | 积分的过程就是求所有反导函数的过程;													|
# | x² + x 是 2x + 1 的其中一个反导函数;												|
# | x² + x + c 是 2x + 1 的所有反导函数;												|
# |																					|
# | 例2:																				|
# | 自由落体问题中: 物体从 1000 米高的位置自由落体, 求得多少秒落地.							|
# |																					|
# | 自由落体:																			|
# | ds / dt = -9.8t;																|
# | s: 物体高度;																		|
# | t: 下降时间;																		|
# |																					|
# | 计算 s( t ):																		|
# | s( t ) = ∫ds = ∫( ds / dt ) * dt:												|
# | s( t ) = ∫ds = ∫( -9.8t ) * dt:													|
# | s( t ) = -4.9t² + c;															|
# | 代入初始条件 c = 1000, 得到 s( t );												|
# | s( t ) = -4.9t² + 1000;															|
# |																					|
# | 计算下落时间:																		|
# | 0 = -4.9t² + 1000;																|
# | t = √(204) = 14.3;																|
# | 物体在 14.3 秒后落地																|
# |---------------------------------------------------------------------------------|

# |---------------------------------------------------------------------------------|
# | 定积分: f( b ) - f( a ) = ∫ᵇₐ( df / dx ) * dx;									|
# | 代表: f( x ) 图形在 x 轴上方 a, b 之间的面积;										|
# | 比如运动中 y 坐标为速度 v, x 坐标为时间, 则运动的距离就是函数围成的图形面积				|
# |																					|
# | 例1:																				|
# | 若在坐标轴中放置 3 * 2 的长方形,														|
# | 长方形四个顶点坐标: ( 0, 2 ), ( 3, 2 ), ( 3, 0 ), ( 0, 0 );							|
# | 则:																				|
# | 导函数: df / dx = 2;																|
# | 原函数: f( x ) = 2x;																|
# | 定积分: ∫³₀( df / dx ) * dx = 2 * 3 - 2 * 0 = 6;									|
# | 结论: 定积分的结果代表图形面积;														|
# |																					|
# | 例2:																				|
# | 若在坐标轴中放置直角三角形, 三个顶点坐标: ( 0, 0 ), ( 2, 3 ), ( 2, 0 );				|
# | 则:																				|
# | 导函数: df / dx = 1.5x;															|
# | 原函数: f( x ) = 0.75 * x²;														|
# | 定积分: ∫²₀( df / dx ) * dx = 0.75 * 2² - 0.75 * 0² = 3.0;						|
# | 结论: 定积分的结果代表图形面积;														|
# |---------------------------------------------------------------------------------|

# |---------------------------------------------------------------------------------|
# | 函数平均数																		|
# | 定义为: f( x ) 中 x 在 a, b 之间的平均数为 ( 1 / ( b - a ) ) * ∫ᵇₐ( dy / dx ) * dx;	|
# | 意思是: 求得定积分也就是面积后除以 x 轴长度得到等分矩形的高为平均数;						|
# |																					|
# | 例:																				|
# | f( x ) = x²; 求得 0 < x < 2 之间的函数平均数等于多少;								|
# |																					|
# | u = ( 1 / ( b - a ) ) * ∫ᵇₐ( dy / dx ) * dx;									|
# |   = 1 / 2 * ∫²₀( x² ) * dx;														|
# |   = 1 / 2 * ( ( 1 / 3 ) * 2³ - ( 1 / 3 ) * 0³ );								|
# |   = 4 / 3;																		|
# |																					|
# | 则函数 f( x ) 在 0 到 2 之间的平均数是 4 / 3;										|
# |---------------------------------------------------------------------------------|

