# |-----------------------------------------------------------------------------------------|
# | 信息熵:																					|
# | 1: 信息量越大 -> 编码越长 -> 越不容易判断														|
# | 2: 信息熵是所有可能发生事件所带来的信息量的期望, ( 获取一个结论所需要的信息量 )						|
# |    判断一只鸡是公鸡还是母鸡 -> 需要信息: 鸡冠大小 -> 信息熵小									|
# |    判断人的性格是外向或内向 -> 需要信息: 工作, 兴趣, 交流, ... -> 信息熵大						|
# |																							|
# | 推导:																					|
# | 1: 等概率事件																				|
# | 1bit: [ ] -> 0 or 1 -> 可以代表 2 个状态 -> 2¹												|
# |																							|
# | 2bit: [ ] [ ] -> status1: 0 1 -> 可以代表 4 个状态 -> 2²									|
# | 				 status2: 1 0															|
# | 				 status3: 0 0															|
# | 				 status4: 1 1															|
# |																							|
# | 3bit: [ ] [ ] [ ] -> status1: 0 0 0 -> 可以代表 8 个状态 -> 2³								|
# | 					 status2: 0 0 1														|
# | 					 status3: 0 1 0														|
# | 					 status4: 0 1 1														|
# | 					 status5: 1 0 0														|
# | 					 status6: 1 0 1														|
# | 					 status7: 1 1 0														|
# | 					 status8: 1 1 1														|
# |																							|
# | -> 能表示的等可能事件数量( n )随 bit 位数( n )指数上升 -> p = 2ⁿ;								|
# |    得到 bit 位数( y )关于能表示的等可能事件数量( x )的方程										|
# |																							|
# | -> y = log₂( x );																		|
# |																							|
# | 2: 不等概率事件																			|
# | 人们更倾向于将不等概率事件转化为等概率的事件													|
# | 比如某事件有两个状态, 但出现 status1 的概率是 0.2, 出现 status2 的概率是 0.8					|
# |																							|
# | -> n = 1 ⁄ p;																			|
# |    p: 事件的概率值																			|
# |    n: 模拟的等概率系统中事件的数量															|
# |																							|
# | -> 1 ⁄ 0.2 = 5 -> 模拟的等概率系统: 在选中概率相同的情况下, 5 选 1								|
# |    1 ⁄ 0.8 = 1.25 -> 模拟的等概率系统: 在选中概率相同的情况下, 1.25 选 1						|
# |																							|
# | -> 带入等概率公式 y = log₂( x ) 计算信息量.													|
# |    拆分后的等概率系统出现的概率分别为 0.2 和 0.8												|
# |																							|
# | -> 0.2 * log₂( 1 ⁄ 0.2 ) + 0.8 * log₂( 1 ⁄ 0.8 );										|
# |																							|
# | -> 替换符号																				|
# |																							|
# | -> h( x ) = ∑ⁿᵢ₌₁( pᵢ * log₂( 1 ⁄ pᵢ ) );												|
# |																							|
# | 		  = ∑ⁿᵢ₌₁( pᵢ * ( log₂( 1 ) - log₂( pᵢ ) ) );									|
# |																							|
# | 		  = ∑ⁿᵢ₌₁( pᵢ * ( 0 - log₂( pᵢ ) ) );											|
# |																							|
# | 		  = -∑ⁿᵢ₌₁( pᵢ * log₂( pᵢ ) );													|
# |																							|
# | -> h( x ) = -∑ⁿᵢ₌₁( pᵢ * log₂( pᵢ ) );													|
# |																							|
# | 例:																						|
# | 抛一次硬币的信息熵: h( x ) = -( ( 正面概率 * log₂( 正面概率 ) ) + 反面概率 * log₂( 反面概率 ) );	|
# | 						= -( ( 0.5 * log₂( 0.5 ) ) + 0.5 * log₂( 0.5 ) );				|
# | 						= -( 0.5 * -1 + 0.5 * -1 );										|
# | 						= 1;															|
# |-----------------------------------------------------------------------------------------|

# |-----------------------------------------------------------------------------------------|
# | 联合熵																					|
# | h( x, y ) = -∑ⁿᵢ₌₁( p( x, y ) * log₂( p( x, y ) ) );									|
# | 其中: p( x, y ) 代表事件 x 和事件 y 的联合概率												|
# |																							|
# | 例如: 连续抛两次硬币																		|
# |																							|
# | p( x = 正, y = 正 ) = 0.5 * 0.5 = 0.25;													|
# | p( x = 正, y = 反 ) = 0.5 * 0.5 = 0.25;													|
# | p( x = 反, y = 正 ) = 0.5 * 0.5 = 0.25;													|
# | p( x = 反, y = 反 ) = 0.5 * 0.5 = 0.25;													|
# |																							|
# | h( x, y ) = -( ( 0.25 * log₂( 0.25 ) ) +												|
# | 			   ( 0.25 * log₂( 0.25 ) ) +												|
# | 			   ( 0.25 * log₂( 0.25 ) ) +												|
# | 			   ( 0.25 * log₂( 0.25 ) ) );												|
# | 		  = -( ( 0.25 * -2 ) + ( 0.25 * -2 ) + ( 0.25 * -2 ) + ( 0.25 * -2 ) );			|
# | 		  = 2;																			|
# |-----------------------------------------------------------------------------------------|

# |-----------------------------------------------------------------------------------------|
# | 条件熵																					|
# | 例如:																					|
# | 	专业X	性别Y																		|
# | 1:	数学(1)	男(1)																		|
# | 2:	IT(1)	男(2)																		|
# | 3:	英文(1)	女(1)																		|
# | 4:	数学(2)	男(3)																		|
# | 5:	数学(3)	女(2)																		|
# | 6:	IT(2)	男(4)																		|
# | 7:	英文(2)	女(3)																		|
# | 8:	数学(4)	女(4)																		|
# |																							|
# | 1): 概率 p( x = 数学 ) = 4 ⁄ 8 = 0.5														|
# |																							|
# | 2): 概率 p( x = 英文 ) = 2 ⁄ 8 = 0.25														|
# |																							|
# | 3): 概率 p( x = IT ) = 2 ⁄ 8 = 0.25														|
# |																							|
# | 4): 概率 p( y = 男性 ) = 4 ⁄ 8 = 0.5														|
# |																							|
# | 5): 概率 p( y = 女性 ) = 4 ⁄ 8 = 0.5														|
# |																							|
# | 6): 概率 p( x = 数学, y = 女性 ) = ( 4 ⁄ 8 ) * ( 4 ⁄ 8 ) = 0.25;		专业X	性别Y		|
# | 																1:	数学(1)	男(1)		|
# | 																4:	数学(2)	男(2)		|
# | 																5:	数学(3)	女(1)		|
# | 																8:	数学(4)	女(2)		|
# |																							|
# |																							|
# | 7): 信息熵: h( x ) = -( 0.5 * log₂( 0.5 ) + 0.25 * log₂( 0.25 ) + 0.25 * log₂( 0.25 ) );	|
# | 				  = -( 0.5 * -1 + 0.25 * -2 + 0.25 * -2 );								|
# | 				  = -( -0.5 - 0.5 - 0.5 );												|
# | 				  = -( -1.5 );															|
# | 				  = 1.5;																|
# |																							|
# | 8): 信息熵: h( y ) = -( 0.5 * log₂( 0.5 ) + 0.5 * log₂( 0.5 ) );							|
# | 				  = -( -0.5 - 0.5 );													|
# | 				  = 1;																	|
# |																							|
# | 9): 条件熵 h( y | x ):																	|
# |		1): 给定条件 x = xᵢ 后, 所有不同 x = xᵢ 值情况下 y 的信息熵之和再乘各自概率.					|
# |		h( y | x ) = ∑ⁿᵢ₌₁( p( x = xᵢ ) * h( x = xᵢ ) );									|
# |			1): p( x = xᵢ ): 在特定的条件 xᵢ 下的概率;											|
# |			2): h( y | x = xᵢ ): 在特定的条件 xᵢ 下, y 的信息熵;								|
# |																							|
# |		2): 描述 x 和 y 所需的信息是描述 x 所需的信息加上给定 x 的条件下具体化 y 所需的额外信息			|
# |		条件熵与联合熵的关系：h( y | x ) = h( x, y ) - h( x );									|
# |		给定 x 时 y 的条件熵 = x, y 的联合熵 - x 的信息熵;										|
# |																							|
# | 例如:																					|
# | 1): 计算各条件下的信息熵:																	|
# | 当专业为数学时, y 的信息熵 h( x ) 值表示为 h( y | x = 数学 );		专业X	性别Y				|
# | 														1:	数学(1)	男(1)				|
# | 														4:	数学(2)	男(2)				|
# | 														5:	数学(3)	女(1)				|
# | 														8:	数学(4)	女(2)				|
# | p( x = 数学 ) = 4 / 8 = 0.5;																|
# | h( y | x = 数学 ) = -( 0.5 * log₂( 0.5 ) + 0.5 * log₂( 0.5 ) );							|
# | 				 = -( 0.5 * -1 + 0.5 * -1 );											|
# | 				 = -( -0.5 - 0.5 );														|
# | 				 = 1;																	|
# |																							|
# | 当专业为英文时, y 的信息熵 h( x ) 值表示为 h( y | x = 英文 );		专业X	性别Y				|
# | 														1:	英文(1)	女(1)				|
# | 														2:	英文(2)	女(2)				|
# | p( x = 英文 ) = 2 / 8 = 0.25;															|
# | h( y | x = 英文 ) = -( 1 * log₂( 1 ) );													|
# | 				 = -( 1 * 0 );															|
# | 				 = 0;																	|
# |																							|
# | 当专业为IT时, y 的信息熵 h( x ) 值表示为 h( y | x = IT );	专业X	性别Y					|
# | 													1:	IT(1)	男(1)					|
# | 													2:	IT(2)	男(2)					|
# | p( x = IT ) = 2 / 8 = 0.25;																|
# | h( y | x = IT ) = -( 1 * log₂( 1 ) );													|
# | 				 = -( 1 * 0 );															|
# | 				 = 0;																	|
# |																							|
# | 2): 计算各条件下的信息熵之和再乘各自概率:														|
# | 所有 h( y | x ) = ( p( x = 数学 ) * h( y | x = 数学 ) ) +									|
# | 				 ( p( x = 英文 ) * h( y | x = 英文 ) ) +									|
# | 				 ( p( x = IT ) * h( y | x = IT ) );										|
# | 			   = 0.5 * 1 + 1 * 0 + 1 * 0;												|
# | 			   = 0.5;																	|
# |																							|
# | 得到:																					|
# | 1: 条件熵: h( y | x ) = 0.5;																|
# | 2: 信息熵: h( x ) = -∑ⁿᵢ₌₁( pᵢ * log₂( pᵢ ) ) = -( ( 0.5 * log₂( 0.5 ) ) +				|
# | 												  ( 0.25 * log₂( 0.25 ) ) +				|
# |													  ( 0.25 * log₂( 0.25 ) ) );			|
# | 				 = 1.5;																	|
# | 3: 联合熵:																				|
# | 带入公式 h( y | x ) = h( x, y ) - h( x ); 得到												|
# | h( x, y ) = h( x ) + h( y | x );														|
# | 					 = 1.5 + 0.5;														|
# | 					 = 2;																|
# | 通过直接计算验证:																			|
# | p( x = 数学, y = 男性 ) = 0.5 * 0.5 = 0.25;												|
# | p( x = 数学, y = 女性 ) = 0.5 * 0.5 = 0.25;												|
# | p( x = 英文, y = 男性 ) = 0.25 * 0 = 0;													|
# | p( x = 英文, y = 女性 ) = 0.25 * 1 = 0.25;												|
# | p( x = IT, y = 男性 ) = 0.25 * 1 = 0.25;													|
# | p( x = IT, y = 女性 ) = 0.25 * 0 = 0;													|
# | h( x, y ) = -∑ⁿᵢ₌₁( p( x, y ) * log₂( p( x, y ) ) )										|
# | 		  = -( ( p( x = 数学, y = 男性 ) * log₂( p( x = 数学, y = 男性 ) ) ) +				|
# | 			   ( p( x = 数学, y = 女性 ) * log₂( p( x = 数学, y = 女性 ) ) ) +				|
# | 			   ( p( x = 英文, y = 男性 ) * log₂( p( x = 英文, y = 男性 ) ) ) +				|
# | 			   ( p( x = IT, y = 男性 ) * log₂( p( x = IT, y = 男性 ) ) ) +				|
# | 			   ( p( x = IT, y = 女性 ) * log₂( p( x = IT, y = 女性 ) ) ) )				|
# | 		  = -( 0.25 * log₂( 0.25 ) * 4 );												|
# | 		  = -( 0.25 * -2 * 4 );															|
# | 		  = 2;																			|
# |-----------------------------------------------------------------------------------------|

# |---------------------------------------------------------------------------------------------------------|
# | 信息增益																									|
# | 表示给定 x 的信息而使 y 的信息熵减少的程度. 信息增益 = 信息熵 - 条件熵											|
# |																											|
# | 例如																										|
# | 		x₁			x₂		x₃		x₄			x₅			x₆		x₇		y							|
# | index	发烧或发冷	喉咙痛	咳嗽		头痛或身体痛	鼻塞或流鼻涕	疲劳		发烧		诊断							|
# | 1		轻微 1		是 1		中等 2	没有 0		是 1			轻微 1	没有 0	感冒							|
# | 2		中等 2		否 0		严重 3	严重 2		否 0			严重 2	较高 2	流感							|
# | 3		严重 3		否 0		没有 0	中等 1		是 1			轻微 1	轻微 1	流感							|
# | 4		没有 0		否 0		轻微 1	中等 1		是 1			没有 0	轻微 1	感冒							|
# | 5		严重 3		是 1		中等 2	严重 2		否 0			严重 2	较高 2	流感							|
# | 6		没有 0		是 1		中等 2	没有 0		是 1			没有 0	没有 0	感冒							|
# | 7		中等 2		否 0		中等 2	严重 2		否 0			严重 2	较高 2	流感							|
# | 8		没有 0		是 1		严重 3	没有 0		否 0			轻微 1	轻微 1	感冒							|
# | 种类		4 种			2 种		4 种		3 种			2 种			3 种		3 种		2 种							|
# |																											|
# | 1: 计算 y 信息熵																							|
# | ########################## y 信息熵 start ##########################										|
# | p( y = 感冒: 诊断为感冒 ) = 4 / 8 = 0.5;																	|
# | p( y = 流感: 诊断为流感 ) = 4 / 8 = 0.5;																	|
# |																											|
# | h( y ) = -( ( p( 感冒 ) * log₂( p( 感冒 ) ) ) + p( 流感 ) * log₂( p( 流感 ) ) );							|
# | 	   = -( ( 0.5 * log₂( 0.5 ) ) + 0.5 * log₂( 0.5 ) );												|
# | 	   = 1;																								|
# | ########################## y 信息熵 end ##########################										|
# |																											|
# | 2: 计算特征 xᵢ 信息熵和信息增益																				|
# | ########################## x₁ 发烧或发冷 start ##########################									|
# | p( x₁ = 0: 没有发烧发冷 ) = 3 / 8 = 0.375;																	|
# | p( x₁ = 1: 轻微发烧发冷 ) = 1 / 8 = 0.125;																	|
# | p( x₁ = 2: 中等发烧发冷 ) = 2 / 8 = 0.25;																	|
# | p( x₁ = 3: 严重发烧发冷 ) = 2 / 8 = 0.25;																	|
# |																											|
# | p( x₁ = 没有发烧发冷, y = 感冒: 没有发烧发冷时感冒的概率 ) = 3 / 3 = 1;										|
# | p( x₁ = 没有发烧发冷, y = 流感: 没有发烧发冷时流感的概率 ) = 0 / 3 = 0;										|
# |																											|
# | p( x₁ = 轻微发烧发冷, y = 感冒: 轻微发烧发冷时感冒的概率 ) = 1 / 1 = 1;										|
# | p( x₁ = 轻微发烧发冷, y = 流感: 轻微发烧发冷时流感的概率 ) = 0 / 1 = 0;										|
# |																											|
# | p( x₁ = 中等发烧发冷, y = 感冒: 中等发烧发冷时感冒的概率 ) = 0 / 2 = 0;										|
# | p( x₁ = 中等发烧发冷, y = 流感: 中等发烧发冷时流感的概率 ) = 2 / 2 = 1;										|
# |																											|
# | p( x₁ = 严重发烧发冷, y = 感冒: 严重发烧发冷时感冒的概率 ) = 0 / 2 = 0;										|
# | p( x₁ = 严重发烧发冷, y = 流感: 严重发烧发冷时流感的概率 ) = 2 / 2 = 1;										|
# |																											|
# | h( y | x₁ = 没有发烧发冷 ) = -( p( x₁ = 没有发烧发冷, y = 感冒 ) * log₂( p( x₁ = 没有发烧发冷, y = 感冒 ) ) +	|
# | 						p( x₁ = 没有发烧发冷, y = 流感 ) * log₂( p( x₁ = 没有发烧发冷, y = 流感 ) ) );		|
# | 						= -( 1 * log₂( 1 ) + 0 * log₂( 0 ) );											|
# | 						= 0;																			|
# |																											|
# | h( y | x₁ = 轻微发烧发冷 ) = -( p( x₁ = 轻微发烧发冷, y = 感冒 ) * log₂( p( x₁ = 轻微发烧发冷, y = 感冒 ) ) +	|
# | 						p( x₁ = 轻微发烧发冷, y = 流感 ) * log₂( p( x₁ = 轻微发烧发冷, y = 流感 ) ) );		|
# | 						= -( 1 * log₂( 1 ) + 0 * log₂( 0 ) );											|
# | 						= 0;																			|
# |																											|
# | h( y | x₁ = 中等发烧发冷 ) = -( p( x₁ = 中等发烧发冷, y = 感冒 ) * log₂( p( x₁ = 中等发烧发冷, y = 感冒 ) ) +	|
# | 						p( x₁ = 中等发烧发冷, y = 流感 ) * log₂( p( x₁ = 中等发烧发冷, y = 流感 ) ) );		|
# | 						= -( 0 * log₂( 0 ) + 1 * log₂( 1 ) );											|
# | 						= 0;																			|
# |																											|
# | h( y | x₁ = 严重发烧发冷 ) = -( p( x₁ = 严重发烧发冷, y = 感冒 ) * log₂( p( x₁ = 严重发烧发冷, y = 感冒 ) ) +	|
# | 						p( x₁ = 严重发烧发冷, y = 流感 ) * log₂( p( x₁ = 严重发烧发冷, y = 流感 ) ) );		|
# | 						= -( 0 * log₂( 0 ) + 1 * log₂( 1 ) );											|
# | 						= 0;																			|
# |																											|
# | h( y | x₁ ) = p( x₁ = 0: 没有发烧发冷 ) * h( y | x₁ = 没有发烧发冷 ) +										|
# | 			  p( x₁ = 1: 轻微发烧发冷 ) * h( y | x₁ = 轻微发烧发冷 ) +										|
# | 			  p( x₁ = 2: 中等发烧发冷 ) * h( y | x₁ = 中等发烧发冷 ) +										|
# | 			  p( x₁ = 3: 严重发烧发冷 ) * h( y | x₁ = 严重发烧发冷 ) +										|
# | 			= 0 * 0.375 + 0 * 0.125 + 0 * 0.25 + 0 * 0.25;												|
# | 			= 0;																						|
# |																											|
# | g( y | x₁ ) = h( y ) - h( y | x₁ );																		|
# | 			= 1 - 0;																					|
# | 			= 1;																						|
# | ########################## x₁ 发烧或发冷 end ##########################									|
# |																											|
# | ########################## x₂ 喉咙痛 start ##########################										|
# | p( x₂ = 是: 喉咙痛 ) = 4 / 8 = 0.5;																		|
# | p( x₂ = 否: 喉咙不痛 ) = 4 / 8 = 0.5;																		|
# |																											|
# | p( x₂ = 是, y = 感冒: 喉咙痛时感冒的概率 ) = 3 / 4 = 0.75;													|
# | p( x₂ = 是, y = 流感: 喉咙痛时流感的概率 ) = 1 / 4 = 0.25;													|
# |																											|
# | p( x₂ = 否, y = 感冒: 喉咙痛时感冒的概率 ) = 1 / 4 = 0.25;													|
# | p( x₂ = 否, y = 流感: 喉咙痛时流感的概率 ) = 3 / 4 = 0.75;													|
# |																											|
# | h( y | x₂ = 是 ) = -( p( x₂ = 是, y = 感冒 ) * log₂( p( x₂ = 是, y = 感冒 ) ) +							|
# | 					p( x₂ = 是, y = 流感 ) * log₂( p( x₂ = 是, y = 流感 ) ) );								|
# | 				= -( 0.75 * log₂( 0.75 ) + 0.25 * log₂( 0.25 ) );										|
# | 				= - 0.415037499279 * 0.75 - 2 * 0.25;													|
# | 				= 0.81127812445925;																		|
# |																											|
# | h( y | x₂ = 否 ) = -( p( x₂ = 否, y = 感冒 ) * log₂( p( x₂ = 否, y = 感冒 ) ) +							|
# | 					p( x₂ = 否, y = 流感 ) * log₂( p( x₂ = 否, y = 流感 ) ) );								|
# | 				= -( 0.25 * log₂( 0.25 ) + 0.75 * log₂( 0.75 ) );										|
# | 				= -2 * 0.25 - 0.415037499279 * 0.75;													|
# | 				= 0.81127812445925;																		|
# |																											|
# | h( y | x₂ ) = p( x₂ = 是: 喉咙痛 ) * h( y | x₂ = 是 ) +													|
# | 			  p( x₂ = 否: 喉咙不痛 ) * h( y | x₂ = 否 );													|
# | 			= 0.81127812445925 * 0.5 + 0.81127812445925 * 0.5;											|
# | 			= 0.81127812445925;																			|
# |																											|
# | g( y | x₂ ) = h( y ) - h( y | x₂ );																		|
# | 			= 1 - 0.81127812445925;																		|
# | 			= 0.18872187554075004;																		|
# | ########################## x₂ 喉咙痛 end ##########################										|
# |																											|
# | ########################## x₃ 咳嗽 start ##########################										|
# | p( x₃ = 0: 没有咳嗽 ) = 1 / 8 = 0.125;																	|
# | p( x₃ = 1: 轻微咳嗽 ) = 1 / 8 = 0.125;																	|
# | p( x₃ = 2: 中等咳嗽 ) = 4 / 8 = 0.5;																		|
# | p( x₃ = 3: 严重咳嗽 ) = 2 / 8 = 0.25;																		|
# |																											|
# | p( x₃ = 没有咳嗽, y = 感冒: 没有发烧发冷时感冒的概率 ) = 0 / 1 = 0;											|
# | p( x₃ = 没有咳嗽, y = 流感: 没有发烧发冷时流感的概率 ) = 1 / 1 = 1;											|
# |																											|
# | p( x₃ = 轻微咳嗽, y = 感冒: 没有发烧发冷时感冒的概率 ) = 1 / 1 = 1;											|
# | p( x₃ = 轻微咳嗽, y = 流感: 没有发烧发冷时流感的概率 ) = 0 / 1 = 0;											|
# |																											|
# | p( x₃ = 中等咳嗽, y = 感冒: 没有发烧发冷时感冒的概率 ) = 2 / 4 = 0.5;											|
# | p( x₃ = 中等咳嗽, y = 流感: 没有发烧发冷时流感的概率 ) = 2 / 4 = 0.5;											|
# |																											|
# | p( x₃ = 严重咳嗽, y = 感冒: 没有发烧发冷时感冒的概率 ) = 1 / 2 = 0.5;											|
# | p( x₃ = 严重咳嗽, y = 流感: 没有发烧发冷时流感的概率 ) = 1 / 2 = 0.5;											|
# |																											|
# | h( y | x₃ = 没有咳嗽 ) = -( p( x₁ = 没有咳嗽, y = 感冒 ) * log₂( p( x₁ = 没有咳嗽, y = 感冒 ) ) +				|
# | 						p( x₁ = 没有咳嗽, y = 流感 ) * log₂( p( x₁ = 没有咳嗽, y = 流感 ) ) );				|
# | 						= -( 0 * log₂( 0 ) + 1 * log₂( 1 ) );											|
# | 						= 0;																			|
# |																											|
# | h( y | x₃ = 轻微咳嗽 ) = -( p( x₁ = 轻微咳嗽, y = 感冒 ) * log₂( p( x₁ = 轻微咳嗽, y = 感冒 ) ) +				|
# | 						p( x₁ = 轻微咳嗽, y = 流感 ) * log₂( p( x₁ = 轻微咳嗽, y = 流感 ) ) );				|
# | 						= -( 1 * log₂( 1 ) + 0 * log₂( 0 ) );											|
# | 						= 0;																			|
# |																											|
# | h( y | x₃ = 中等咳嗽 ) = -( p( x₁ = 中等咳嗽, y = 感冒 ) * log₂( p( x₁ = 中等咳嗽, y = 感冒 ) ) +				|
# | 						p( x₁ = 中等咳嗽, y = 流感 ) * log₂( p( x₁ = 中等咳嗽, y = 流感 ) ) );				|
# | 						= -( 0.5 * log₂( 0.5 ) + 0.5 * log₂( 0.5 ) );									|
# | 						= -( 0.5 * -1 + 0.5 * -1 );														|
# | 						= 1;																			|
# |																											|
# | h( y | x₃ = 严重咳嗽 ) = -( p( x₁ = 严重咳嗽, y = 感冒 ) * log₂( p( x₁ = 严重咳嗽, y = 感冒 ) ) +				|
# | 						p( x₁ = 严重咳嗽, y = 流感 ) * log₂( p( x₁ = 严重咳嗽, y = 流感 ) ) );				|
# | 						= -( 0.5 * log₂( 0.5 ) + 0.5 * log₂( 0.5 ) );									|
# | 						= -( 0.5 * -1 + 0.5 * -1 );														|
# | 						= 1;																			|
# |																											|
# | h( y | x₃ ) = p( x₃ = 0: 没有咳嗽 ) * h( y | x₃ = 没有咳嗽 ) +												|
# | 			  p( x₃ = 1: 轻微咳嗽 ) * h( y | x₃ = 轻微咳嗽 ) +												|
# | 			  p( x₃ = 2: 中等咳嗽 ) * h( y | x₃ = 中等咳嗽 ) +												|
# | 			  p( x₃ = 3: 严重咳嗽 ) * h( y | x₃ = 严重咳嗽 ) +												|
# | 			= 0 * 0.125 + 0 * 0.125 + 1 * 0.5 + 1 * 0.25;												|
# | 			= 0.75;																						|
# |																											|
# | g( y | x₃ ) = h( y ) - h( y | x₂ );																		|
# | 			= 1 - 0.75;																					|
# | 			= 0.25;																						|
# | ########################## x₃ 咳嗽 end ##########################										|
# | ... ...																									|
# | g( y | x₁ ) = 1.0000;																					|
# | g( y | x₂ ) = 0.1887;																					|
# | g( y | x₃ ) = 0.2500;																					|
# | g( y | x₄ ) = 0.7500;																					|
# | g( y | x₅ ) = 0.1887;																					|
# | g( y | x₆ ) = 0.6556;																					|
# | g( y | x₇ ) = 0.6556;																					|
# |---------------------------------------------------------------------------------------------------------|

# |---------------------------------------------------------------------------------------------------------|
# | ID3 算法的缺陷																							|
# | 1: 无法处理连续性的特征, 因为 ID3 每次切分数据时选择的不是一个特征的取值, 而是一个具体的特征;							|
# | 该特征下有多少取值就会产生多少分叉, 若使用连续性特征比如西瓜的直径作为特征, 则理论上来说每个西瓜的直径都不同,				|
# | 这样的数据丢进 ID3 算法当中就会产生和样本数量相同的分叉, 这是没有意义的;											|
# |																											|
# | 2: 关于信息增益: 因为使用信息熵的差作为信息增益, 然后选择带来最大信息增益进行划分,									|
# | 会导致模型倾向于选择分叉比较多的特征, 极端情况下比如连续性特征, 此时条件熵:											|
# | h( y | x ) = ∑ⁿᵢ₌₁( p( x = xᵢ ) * ( h( x = xᵢ ) = 0 ) ) = 0, 则得到的信息增益非常大,						|
# | 但分叉多的特征并不一定划分效果好;																				|
# |---------------------------------------------------------------------------------------------------------|

# |---------------------------------------------------------------------------------------------------------|
# | C4.5 算法																								|
# | 相比于 ID3 采用信息增益作为分枝条件, C4.5 采用了信息增益率作为分枝条件;											|
# | 信息增益率: gainratio = g( y | xᵢ ) / H( xᵢ );															|
# | H( xᵢ ) = -( pᵢ * log₂( pᵢ ) ); 某种划分条件后的数据集对比总数据集得到的信息熵;									|
# | 比如: 共 10 个样本划分为 2 份和 8 份, 则分母为 (2/10) * log₂(2/10) + (8/10) * log₂(8/10)						|
# |																											|
# | 信息增益存在分母后若条件因子越多则 g( y | xᵢ ) 越大但对应的信息熵 H( xᵢ ) 也越大, 就能防止算法倾向选择因子过多的条件;	|
# |---------------------------------------------------------------------------------------------------------|

# |---------------------------------------------------------------------------------------------------------|
# | 对于第一个不能处理连续特征的问题, C4.5 将连续的特征离散化;														|
# | 比如 n 个样本的连续特征 A 有 n 个, 从小到大排列为:																|
# | a₁, a₂, ..., aₙ;																							|
# |																											|
# | 则 C4.5 取相邻两样本值的中位数, 共可取得 n - 1 个划分点, 其中第 i 个划分点表示 Tᵢ 表示为:							|
# | Tᵢ = ( aᵢ + aᵢ₊₁ ) / 2;																					|
# |																											|
# | 对于这 n - 1 个点: 分别计算以该点为分类点时其上下两部分的信息增益, 选择信息增益最大的点作为该连续特征的分类点:			|
# | 比如取到的增益最大的点为 aₜ, 则小于 aₜ 的值为类别 1, 大于 aₜ 的值为类别 2, 做到连续特征的离散化;						|
# |																											|
# | 对于连续值只切成两份, 因大多数情况每条数据连续值特征往往都不同, 没有办法很好地确定对于连续值特征究竟分成几个部分比较合理,	|
# | 故比较直观的就是固定切分成两份;																				|
# |																											|
# | 例:																										|
# | 总数据集:																									|
# | -----------------------------------------																|
# | |	婚姻情况	 |	年收入	 |	偿还债务能力	|																|
# | |------------|-----------|--------------|																|
# | |	   单身	 |	  125	 |			否	|																|
# | |------------|-----------|--------------|																|
# | |	   已婚	 |	  100	 |			否	|																|
# | |------------|-----------|--------------|																|
# | |	   单身	 |	   70	 |			是	|																|
# | |------------|-----------|--------------|																|
# | |	   已婚	 |	  120	 |			否	|																|
# | |------------|-----------|--------------|																|
# | |	   离婚	 |	   95	 |			是	|																|
# | -----------------------------------------																|
# |																											|
# | 信息熵: h( y ) = ( 3 / 5 ) * log₂( 3 / 5 ) + ( 2 / 5 ) * log₂( 2 / 5 ) = 0.971;							|
# |																											|
# | 年收入: 70, 95, 100, 120, 125;																			|
# | 取中值: 82.5, 97.5, 110, 122.5;																			|
# |																											|
# | ---------------------------------------------------------												|
# | | T( 82.5 ):											|												|
# | | 对于 T > 82.5: 计算信息熵增益率: 							|												|
# | | ---------------------------							|												|
# | | |	婚姻情况	 |	偿还债务能力	|							|												|
# | | |----------|--------------|							|												|
# | | |	   单身	 |			否	|							|												|
# | | |----------|--------------|							|												|
# | | |	   已婚	 |			否	|							|												|
# | | |----------|--------------|							|												|
# | | |	   已婚	 |			否	|							|												|
# | | |----------|--------------|							|												|
# | | |	   离婚	 |			是	|							|												|
# | | ---------------------------							|												|
# | |														|												|
# | | 对于 T < 82.5: 计算信息熵增益率: 							|												|
# | | ---------------------------							|												|
# | | |	婚姻情况	 |	偿还债务能力	|							|												|
# | | |----------|--------------|							|												|
# | | |	   单身	 |			是	|							|												|
# | | ---------------------------							|												|
# | ---------------------------------------------------------												|
# |																											|
# | ---------------------------------------------------------												|
# | | T( 97.5 ):											|												|
# | | 对于 T > 97.5: 计算信息熵增益率: 							|												|
# | | ---------------------------							|												|
# | | |	婚姻情况	 |	偿还债务能力	|							|												|
# | | |----------|--------------|							|												|
# | | |	   单身	 |			否	|							|												|
# | | |----------|--------------|							|												|
# | | |	   已婚	 |			否	|							|												|
# | | |----------|--------------|							|												|
# | | |	   已婚	 |			否	|							|												|
# | | ---------------------------							|												|
# | |														|												|
# | | 对于 T < 97.5: 计算信息熵增益率: 							|												|
# | | ---------------------------							|												|
# | | |	婚姻情况	 |	偿还债务能力	|							|												|
# | | |----------|--------------|							|												|
# | | |	   单身	 |			是	|							|												|
# | | |----------|--------------|							|												|
# | | |	   离婚	 |			是	|							|												|
# | | ---------------------------							|												|
# | ---------------------------------------------------------												|
# |																											|
# | 同理																										|
# | ---------------------------------------------------------												|
# | | T( 110 ): 计算信息熵增益率;								|												|
# | ---------------------------------------------------------												|
# |																											|
# | ---------------------------------------------------------												|
# | T( 122.5 ): 计算信息熵增益率;								|												|
# | ---------------------------------------------------------												|
# |																											|
# | 最后发现当 T( 97.5 ) 作为划分时, 信息增益最大, 也就是年收入以 97.5 作为阀值, 划分的数据集不确定性最小;				|
# |---------------------------------------------------------------------------------------------------------|


