import numpy as np;
import pandas as pd;
from matplotlib import pyplot as plt;

# 表格
dataframe = pd.read_csv( "./data1.ml1.csv", header = 0 );
#           x         y
# 0    6.1101  17.59200
# 1    5.5277   9.13020
# 2    8.5186  13.66200
# 3    7.0032  11.85400
# 4    5.8598   6.82330
# ..      ...       ...
# 92   5.8707   7.20290
# 93   5.3054   1.98690
# 94   8.2934   0.14454
# 95  13.3940   9.05510
# 96   5.4369   0.61705
# 
# [97 rows x 2 columns]

# 长度
size = dataframe.shape[ 0 ];
# 97

# 初始: y = a * x + b -> theta = [ b, a ];
theta = np.array( [ 0, 0 ] );
# [ 0, 0 ]

# 数据
data = np.array( dataframe );
# [ [ 6.1101, 17.592 ]
#   [ 5.5277, 9.1302 ]
#   [ 8.5186, 13.662 ]
#   [ 7.0032, 11.854 ]
#   [ 5.8598, 6.8233 ]
#   ...
#   [ 5.8707,  7.2029 ]
#   [ 5.3054,  1.9869 ]
#   [ 8.2934, 0.14454 ]
#   [ 13.394,  9.0551 ]
#   [ 5.4369, 0.61705 ] ]

data = np.hstack( [ np.ones( [ size, 1 ] ), data ] );
# [ [ 1, 6.1101, 17.592 ]
#   [ 1, 5.5277, 9.1302 ]
#   [ 1, 8.5186, 13.662 ]
#   [ 1, 7.0032, 11.854 ]
#   [ 1, 5.8598, 6.8233 ]
#   ...
#   [ 1, 5.8707,  7.2029 ]
#   [ 1, 5.3054,  1.9869 ]
#   [ 1, 8.2934, 0.14454 ]
#   [ 1, 13.394,  9.0551 ]
#   [ 1, 5.4369, 0.61705 ] ]

y = data[ :, 2 ];
# [ 17.592,  9.1302,  13.662,  11.854, 6.8233,   11.886,  4.3483,      12,
#   6.5987,  3.8166,  3.2522,  15.505, 3.1551,   7.2258, 0.71618,  3.5129,
#   5.3048, 0.56077,  3.6518,  5.3893, 3.1386,   21.767,   4.263,  5.1875,
#   3.0825,  22.638,  13.501,  7.0467, 14.692,   24.147,   -1.22,  5.9966,
#   12.134,  1.8495,  6.5426,  4.5623, 4.1164,   3.3928,  10.117,  5.4974,
#  0.55657,  3.9115,  5.3854,  2.4406, 6.7318,   1.0463,  5.1337,   1.844,
#   8.0043,  1.0179,  6.7504,  1.8396, 4.2885,   4.9981,  1.4233, -1.4211,
#   2.4756,  4.6042,  3.9624,  5.4141, 5.1694, -0.74279,  17.929,  12.054,
#   17.054,  4.8852,  5.7442,  7.7754, 1.0173,   20.992,  6.6799,  4.0259,
#   1.2784,  3.3411, -2.6807, 0.29678, 3.8845,   5.7014,  6.7526,  2.0576,
#  0.47953, 0.20421, 0.67861,  7.5435, 5.3436,   4.2415,  6.7981, 0.92695,
#    0.152,  2.8214,  1.8451,  4.2959, 7.2029,   1.9869, 0.14454,  9.0551,
#  0.61705 ]

x = data[ :, :2 ]
# [ [ 1, 6.1101 ]
#   [ 1, 5.5277 ]
#   [ 1, 8.5186 ]
#   [ 1, 7.0032 ]
#   [ 1, 5.8598 ]
#   ...
#   [ 1, 5.8707 ]
#   [ 1, 5.3054 ]
#   [ 1, 8.2934 ]
#   [ 1, 13.394 ]
#   [ 1, 5.4369 ] ]

# 损失函数
def costfunction ( theta, x, y ):
	# e` = ¹⁄₂ₙ * ∑ⁿᵢ₌₁( y`ⁱ - yⁱ )² = ¹⁄₂ₙ * ∑ⁿᵢ₌₁( b + a * xⁱ - yⁱ )²;
	#
	# x = [ [ 1, x¹ ],		y = [ [ 1, y¹ ],
	# 		[ 1, x² ],			  [ 1, y² ],
	#		...					  ...
	# 		[ 1, xⁿ ] ];		  [ 1, yⁿ ] ];

	# theta 表示 y = a * x + b;
	# theta = [ b, a ];

	ybar = x.dot( theta );
	# x.dot( theta ) = 1 * b + a * x¹ +
	# 				   1 * b + a * x² +
	# 				   ...
	# 				   1 * b + a * xⁿ;

	return np.sum( ( ybar - y ) ** 2 ) / ( 2 * size );

# 计算当前 theta 取值下的微分值
def gradient ( theta, x, y ):
	# ∂e(w, b)/∂b: ¹⁄ₙ * ∑ⁿᵢ₌₁( y`ⁱ - yⁱ );
	# ∂e(w, a)/∂a: ¹⁄ₙ * ∑ⁿᵢ₌₁( y`ⁱ - yⁱ ) * xⁱ;

	grad = np.empty( len( theta ) );

	ybar = x.dot( theta );

	grad[ 0 ] = np.sum( ybar - y ) / size;

	grad[ 1 ] = ( ybar - y ).dot( x[ :, 1 ] ) / size;

	return grad;

# 主函数
# 步骤:
# 1: 计算 theta 对应的微分值;
# 2: 通过梯度下降更新 theta;
# 3: 通过上一步的 theta 和本次的 theta 代入损失函数计算损失值;
# 4: 损失值基本不变时退出迭代, 输入 theta
def run ( theta, x, y, step = 0.01 ):
	while True:
		lasttheta = theta;

		grad = gradient( theta, x, y );

		theta = theta - step * grad;

		lastcost = costfunction( lasttheta, x, y );

		currentcost = costfunction( theta, x, y );

		if abs( lastcost - currentcost ) < 1e-15:
			break;

	return theta;

theta = run( theta, x, y );

print( "函数为: y = {}x + {}".format( theta[ 1 ], theta[ 0 ] ) );

def fn ( x ):
	return theta[ 1 ] * x + theta[ 0 ];

x = data[ :, 1 ];

y = data[ :, 2 ];

plt.scatter( x, y, s = 2 );

x = np.linspace( -30, 30, 100000 );

plt.plot( x, fn( x ), color = "r", linewidth = 0.8 );

plt.show();
